In [1]:
import pandas as pd
from pandas import DataFrame , Series
import numpy as np

In [4]:
string_data = pd.Series(['apple', 'mango', np.nan, 'orange'])

In [5]:
string_data

0     apple
1     mango
2       NaN
3    orange
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data

0      None
1     mango
2       NaN
3    orange
dtype: object

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

# Filtering Out Missing Data

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned = data.dropna()

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data.dropna(axis=0, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))

In [26]:
df

          0         1         2
0 -0.833559  0.652435  0.065161
1  0.315288 -0.462167 -0.976911
2  1.190682  2.936336  0.070268
3  0.061665 -0.139082  0.976642
4  0.553428  0.334244  0.554653
5  1.590097  0.148553 -0.616398
6  0.484699 -0.482289  0.501864

In [27]:
 df.iloc[:4, 1] = NA

In [28]:
df.iloc[:2, 2] = NA

In [29]:
df

          0         1         2
0 -0.833559       NaN       NaN
1  0.315288       NaN       NaN
2  1.190682       NaN  0.070268
3  0.061665       NaN  0.976642
4  0.553428  0.334244  0.554653
5  1.590097  0.148553 -0.616398
6  0.484699 -0.482289  0.501864

In [30]:
df.dropna()

          0         1         2
4  0.553428  0.334244  0.554653
5  1.590097  0.148553 -0.616398
6  0.484699 -0.482289  0.501864

In [34]:
df.dropna(thresh=2)

          0         1         2
2  1.190682       NaN  0.070268
3  0.061665       NaN  0.976642
4  0.553428  0.334244  0.554653
5  1.590097  0.148553 -0.616398
6  0.484699 -0.482289  0.501864